ErpTest/src/InformationRegisters/ItobСвойстваТранспортныхСредств/ItobСвойстваТранспортныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ItobСвойстваТранспортныхСредств</name>
  <resources>
    <name>МодельТС</name>
    <type>
      <types>CatalogRef.уатМоделиТС</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/ItobНастройкиОтображенияОбъектов/ItobНастройкиОтображенияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ItobНастройкиОтображенияОбъектов</name>
  <resources>
    <name>ДлинаШлейфаOnlineСлежение</name>
    <comment>Длина шлейфа при online слежении (кол-во точек)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеПоказыватьСтрелкуНаправленияДвижения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЦветМаршрутаНаКарте</name>
    <comment>B*256*256 + G*256 + R</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦветНадписиНаКарте</name>
    <comment>B*256*256 + G*256 + R</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИконкаНаКарте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/уатСистемаGPS/уатСистемаGPS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатСистемаGPS</name>
  <comment>Cистема GPS (уат)</comment>
  <enumValues>
    <name>_1СЦСМ</name>
  </enumValues>
  <enumValues>
    <name>Dynafleet</name>
  </enumValues>
  <enumValues>
    <name>Omnicomm</name>
  </enumValues>
  <enumValues>
    <name>PositionReport</name>
  </enumValues>
  <enumValues>
    <name>Wialon</name>
  </enumValues>
  <enumValues>
    <name>АвтоГРАФ</name>
  </enumValues>
  <enumValues>
    <name>Автотрекер</name>
  </enumValues>
  <enumValues>
    <name>СКАУТ</name>
    <comment>СКАУТ</comment>
  </enumValues>
</mdclass:Enum>

ErpTest/src/CommonModules/ItobЦентрСпутниковогоМониторингаСерверПереопределяемый/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обработка событий переопределяемых процедур с Центром спутникового мониторинга
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ПереопределяемыеПроцедуры
	
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ПЕРЕОПРЕДЕЛЯЕМЫЕ ПРОЦЕДУРЫ
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ЗаполнитьРегистрСвойстваТранспортныхСредствПереопределяемый(ЗаписьРегистра, Источник)

	// Здесь можно описать заполнение регистра "СвойстваТранспортныхСредств" по соответствующим полям документов.
	//	Рег.МодельТС           = Источник.Модель;
	//	Рег.Организация        = Источник.Организация;

КонецПроцедуры

#КонецОбласти 

#Область ПроцедурыЗаполненияВСоставеТиповыхОбъектовЦСМ

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ В СОСТАВЕ ТИПОВЫХ ОБЪЕКТОВ ЦСМ
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Дополнительная обработка записи транспортного средства
//
Процедура ЗаписьТранспортногоСредстваПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = РегистрыСведений.ItobСвойстваТранспортныхСредств.Выбрать(Новый Структура("ТранспортноеСредство", Источник.Ссылка));
	Если ItobОбщегоНазначенияСервер.ВыборкаСледующий(Выборка) Тогда
		Рег = Выборка.ПолучитьМенеджерЗаписи();
	Иначе
		Рег = РегистрыСведений.ItobСвойстваТранспортныхСредств.СоздатьМенеджерЗаписи();
		Рег.ТранспортноеСредство = Источник.Ссылка;
	КонецЕсли;
	
	Если Источник.Метаданные().Имя = "ItobТранспортныеСредства" И Источник.Метаданные().Реквизиты.Найти("Марка")<> Неопределено Тогда
		Рег.МодельТС           = Источник.Марка;		
		Рег.Организация        = Источник.Организация;
	Иначе		
		ЗаполнитьРегистрСвойстваТранспортныхСредствПереопределяемый(Рег, Источник);	
	КонецЕсли;
	
	Рег.Записать(Истина);
	
	// Перенесено из модуля формы справочника ТС
	Если Источник.уатИспользуемаяСистемаGPS = Перечисления.уатСистемаGPS._1СЦСМ Тогда
		Выборка = РегистрыСведений.ItobНастройкиОтображенияОбъектов.Выбрать(Новый Структура("Объект", Источник.Ссылка));
		Пока Выборка.Следующий() Цикл
			Запись = Выборка.ПолучитьМенеджерЗаписи();
		КонецЦикла;
		Запись = ?(Запись = Неопределено, РегистрыСведений.ItobНастройкиОтображенияОбъектов.СоздатьМенеджерЗаписи(), Запись); 
		Запись.Объект	 		   = Источник.Ссылка;
		Запись.ЦветМаршрутаНаКарте = Источник.уатЦветМаршрутаНаКарте;
		Запись.ИконкаНаКарте 	   = Источник.уатИконкаНаКарте;
		Запись.Записать(Истина);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти
